package main

import (
	"database/sql"
	_ "github.com/go-sql-driver/mysql"
	"log"
)

var DB1 *sql.DB

func main() {
	InitDB()
	InsertQuestionnaire()
	InsertQuestion()
	InsertOption()
	//UpdateQuestionnaire()
}

func InitDB() {
	db, err := sql.Open("mysql", "root:224488@tcp(127.0.0.1:3306)/herbal?charset=utf8mb4&loc=Local&parseTime=true")
	if err != nil {
		log.Fatalf("connect mysql err:%v", err)
		return
	}
	DB1 = db
	log.Println(db.Ping())
}

func InsertQuestionnaire() {
	stmt, err := DB1.Prepare("insert into questionnaires (questionnaire,suggestion) values (?,?)")
	if err != nil {
		log.Printf("insert err:%v\n", err)
		return
	}
	_, _ = stmt.Exec("阳虚质", "阴虚体质的人需保持心情舒畅，避免烦躁动怒，避免与人争，减少激怒。起居上保证充足睡眠、作息时间规律；\n饮食调理：三餐宜清淡，少进食肥腻厚味、燥烈的食物，可多吃芝麻、糯米、蜂蜜、乳品、银耳、燕窝、百合、雪梨等清淡食物，应少吃葱、姜、蒜、韭菜、辣椒等。肾阴虚者在医生指导下可以选用六味地黄丸等滋阴的中成药。\n")
	_, _ = stmt.Exec("阴虚质", "阳虚者必须加强精神调养，调节自己的情感避免悲忧。在寒热交替之际，衣物更换幅度不要太大，注意身体保暖，冬季多运动，夏季不易剧烈活动；起居上保证充足睡眠，避免劳累过度。饮食调理：多进食性热的食物，如羊肉、鸡肉等肉类熟食，以及荔枝、龙眼、栗子、核桃等，日常可服用韭菜炒虾仁，韭菜炒核桃，冬季可服用当归生姜羊肉汤。少吃生冷食物，少吃冰激凌等寒凉类食物。可用艾灸保健。\n")
	_, _ = stmt.Exec("气虚质", "饮食调理：可常食山药、粳米、小米、黄米、大麦、马铃薯、大枣、胡萝卜、香菇、豆腐、鸡肉、牛肉、青鱼、鲢鱼、龙眼肉、莲子等。气虚严重者可在医生的指导下服用人参、黄芪。起居上要做到劳逸结合，睡眠充足。可适当练习八段锦、太极拳等，春冬两季注意保暖，防寒邪易伤脾胃。\n")
	_, _ = stmt.Exec("痰湿质", "环境调摄：痰湿体质者不宜居住在潮湿的环境里；在阴雨季节，要注意防潮，可使用除湿器。饮食调理：少进食肥甘厚味的食物，多吃蔬菜、水果，尤其是多吃具有健脾利湿、化痰祛湿的食物，如白萝卜、洋葱、白扁豆等。可以使用玉米须、绞股蓝、党参泡水，多进食能行气的食物，如橙子、桔皮、荞麦、韭菜、茴香菜，陈皮、玫瑰花、茉莉花、山楂等。\n")
	_, _ = stmt.Exec("湿热质", "湿热体质的人调养原则为燥湿清热，饮食清淡。在饮食上尽量做到不嗜烟酒，不吃油炸厚腻的食物，也尽量少吃一些大热大补的食物。运动上，适合做高强度、大运动量的锻炼，如中长跑、游泳、爬山、各种球类等运动。湿热明显或已进入中年的人，可选用清热利湿的药物进行调理。如常用菊花、苦丁茶沸水泡服，可起到清热舒爽的作用。起居养生应注意，居住环境宜干燥，通风，避免外湿入体，影响脾胃与心情。\n")
	_, _ = stmt.Exec("血瘀质", "培养乐观的情绪，精神愉快则气血和畅，少生闷气，少动怒，有利于血瘀体质的改善。饮食调理：可常进食桃仁、油菜、黑大豆、山楂、玫瑰等，避免生冷之品；。也可食用山楂粥、花生粥。血瘀体质者可选用活血养血之品，在医生的指导下可使用丹参、川芎、当归、三七粉、枸杞、阿胶、红枣等。生活中多做有利于关节活动的运动，比如健美操、瑜伽等。\n")
	_, _ = stmt.Exec("特禀质", "此体质多为遗传因素，饮食上注意荤素搭配，过敏体质者要避开辛辣、腥味等刺激性强的食物；生活中，过敏体质者要注意季节变化，尤其是春夏季，减少外出时间，防止花粉等异物过敏；积极体检，做到及时预防，及时诊治，调养身心健康。\n")
	_, _ = stmt.Exec("气郁质", "气郁体质需保持心情舒畅，避免思虑过度、心情抑郁。饮食上建议多食芽类、绿叶类、行气类食物，如春芽、韭菜、陈皮粥、葡萄干等，也可多进食柠檬、橙子、陈皮等柑橘类水果，保持心境平和。可在医生的指导下服用逍遥丸等。\n")
	_, _ = stmt.Exec("平和质", "保持积极的状态，饮食均衡，保持良好的生活作息，适当锻炼。\n")
}

func InsertQuestion() {
	stmt, err := DB1.Prepare("insert into questions (questionnaire_id,question_id,question)values (?,?,?)")
	if err != nil {
		log.Printf("insert err:%v\n", err)
		return
	}
	_, _ = stmt.Exec(1, 1, "您手脚发凉吗")
	_, _ = stmt.Exec(1, 2, "您胃脘部、背部或腰膝部怕冷吗")
	_, _ = stmt.Exec(1, 3, "您感到怕冷、衣服比别人穿得多吗")
	_, _ = stmt.Exec(1, 4, "您比一般人不了寒冷（冬天的寒冷，夏天的冷空调、电扇等)")
	_, _ = stmt.Exec(1, 5, "您比别人容易患感冒吗")
	_, _ = stmt.Exec(1, 6, "您吃（喝）凉的东西会感到不舒服或者怕吃（喝）凉东西吗")
	_, _ = stmt.Exec(1, 7, "你受凉或吃（喝）凉的东西后，容易腹泻（拉肚子）吗")

	_, _ = stmt.Exec(2, 1, "您感到手脚心发热吗")
	_, _ = stmt.Exec(2, 2, "您感觉身体、脸上发热吗")
	_, _ = stmt.Exec(2, 3, "您皮肤或口唇干吗")
	_, _ = stmt.Exec(2, 4, "您口唇的颜色比一般人红吗")
	_, _ = stmt.Exec(2, 5, "您容易便秘或大便干燥吗")
	_, _ = stmt.Exec(2, 6, "您面部两潮红或偏红吗")
	_, _ = stmt.Exec(2, 7, "您感到眼睛干涩吗")
	_, _ = stmt.Exec(2, 8, "您活动量稍大就容易出虚汗吗")

	_, _ = stmt.Exec(3, 1, "你容易疲乏吗")
	_, _ = stmt.Exec(3, 2, "您容易气短（呼吸短促，接不上气）吗")
	_, _ = stmt.Exec(3, 3, "您容易心慌吗")
	_, _ = stmt.Exec(3, 4, "您容易头晕或站起时晕眩吗 ")
	_, _ = stmt.Exec(3, 5, "您比别人容易患感冒吗")
	_, _ = stmt.Exec(3, 6, "您喜欢安静、懒得说话吗")
	_, _ = stmt.Exec(3, 7, "您说话声音无力吗")
	_, _ = stmt.Exec(3, 8, "您活动量大就容易出虚汗吗")

	_, _ = stmt.Exec(4, 1, "您感到胸闷或腹部胀满吗")
	_, _ = stmt.Exec(4, 2, "您感到身体学生不轻松或不爽快吗")
	_, _ = stmt.Exec(4, 3, "您腹部肥满松软吗")
	_, _ = stmt.Exec(4, 4, "您有额部油脂分泌多的现象吗")
	_, _ = stmt.Exec(4, 5, "您上眼睑比别人肿（仍轻微隆起的现象）吗")
	_, _ = stmt.Exec(4, 6, "您嘴里有黏黏的感觉吗")
	_, _ = stmt.Exec(4, 7, "您平时痰多，特别是咽喉部总感到有痰堵着吗")
	_, _ = stmt.Exec(4, 8, "您舌苔厚腻或有舌苔厚厚的感觉吗")

	_, _ = stmt.Exec(5, 1, "您面部或鼻部有油腻感或者油亮发光吗")
	_, _ = stmt.Exec(5, 2, "你容易生痤疮或疮疖吗")
	_, _ = stmt.Exec(5, 3, "您感到口苦或嘴里有异味吗")
	_, _ = stmt.Exec(5, 4, "您大使黏滞不爽、有解不尽的感觉吗")
	_, _ = stmt.Exec(5, 5, "您小便时尿道有发热感、尿色浓（深）吗")
	_, _ = stmt.Exec(5, 6, "您带下色黄（白带颜色发黄）吗（限女性回答）")
	_, _ = stmt.Exec(5, 7, "您的阴囊部位潮湿吗(限男性回答)")

	_, _ = stmt.Exec(6, 1, "您的皮肤在不知不觉中会出现青紫瘀斑（皮下出血）吗")
	_, _ = stmt.Exec(6, 2, "您两颧部有细微红丝吗")
	_, _ = stmt.Exec(6, 3, "您身体上有哪里疼痛吗")
	_, _ = stmt.Exec(6, 4, "您面色晦黯或容易出现褐斑吗")
	_, _ = stmt.Exec(6, 5, "您容易有黑眼圈吗")
	_, _ = stmt.Exec(6, 6, "您容易忘事（健忘）吗")
	_, _ = stmt.Exec(6, 7, "您口唇颜色偏黯吗")

	_, _ = stmt.Exec(7, 1, "您没有感冒时也会打喷嚏吗")
	_, _ = stmt.Exec(7, 2, "您没有感冒时也会鼻塞、流鼻涕吗")
	_, _ = stmt.Exec(7, 3, "您有因季节变化、温度变化或异味等原因而咳喘的现象吗")
	_, _ = stmt.Exec(7, 4, "您容易过敏（对药物、食物、气味、花粉或在季节交替、气候变化时）吗")
	_, _ = stmt.Exec(7, 5, "您的皮肤容易起荨麻疹（风团、风疹块、风疙瘩）吗")
	_, _ = stmt.Exec(7, 6, "您的因过敏出现过紫癜（紫红色瘀点、瘀斑）吗")
	_, _ = stmt.Exec(7, 7, "您的皮肤一抓就红，并出现抓痕吗")

	_, _ = stmt.Exec(8, 1, "您感到闷闷不乐吗")
	_, _ = stmt.Exec(8, 2, "您容易精神紧张、焦虑不安吗")
	_, _ = stmt.Exec(8, 3, "您多愁善感、感情脆弱吗")
	_, _ = stmt.Exec(8, 4, "您容易感到害怕或受到惊吓吗")
	_, _ = stmt.Exec(8, 5, "您胁肋部或乳房腹痛吗")
	_, _ = stmt.Exec(8, 6, "您无缘无故叹气吗")
	_, _ = stmt.Exec(8, 7, "您咽喉部有异物感，且吐之不出、咽之不下吗")

	_, _ = stmt.Exec(9, 1, "您精力充沛吗")
	_, _ = stmt.Exec(9, 2, "您容易疲乏吗")
	_, _ = stmt.Exec(9, 3, "您说话声音无力吗")
	_, _ = stmt.Exec(9, 4, "您感到闷闷不乐吗")
	_, _ = stmt.Exec(9, 5, "您比一般人耐受不了寒冷（冬天的寒冷，夏天的冷空调、电扇）吗")
	_, _ = stmt.Exec(9, 6, "您能适应外界自然和社会环境的变化吗")
	_, _ = stmt.Exec(9, 7, "您容易失眠吗")
	_, _ = stmt.Exec(9, 8, "您容易忘事（健忘）吗")

}

func InsertOption() {
	var option = make(map[int]string)
	option[1] = "没有（根本不）"
	option[2] = "很少（有一点）"
	option[3] = "有时（有些）"
	option[4] = "经常（相当）"
	option[5] = "总是（非常）"
	stmt, err := DB1.Prepare("insert into `options` (questionnaire_id,question_id,option_id,`option`) values (?,?,?,?)")
	if err != nil {
		log.Printf("insert err:%v\n", err)
		return
	}
	for i := 1; i <= 9; i++ {
		switch i {
		case 1, 5, 6, 7, 8:
			{
				for j := 1; j <= 7; j++ {
					for k := 1; k <= 5; k++ {
						_, _ = stmt.Exec(i, j, k, option[k])
					}
				}
			}
		case 2, 3, 4, 9:
			{
				for j := 1; j <= 8; j++ {
					for k := 1; k <= 5; k++ {
						_, _ = stmt.Exec(i, j, k, option[k])
					}
				}
			}
		}
	}
}

func UpdateQuestionnaire() {
	stmt, err := DB1.Prepare("update questionnaires set suggestion=? where questionnaire=?")
	if err != nil {
		log.Printf("insert err:%v\n", err)
		return
	}
	_, _ = stmt.Exec("阳虚者必须加强精神调养，调节自己的情感避免悲忧。在寒热交替之际，衣物更换幅度不要太大，注意身体保暖，冬季多运动，夏季不易剧烈活动；起居上保证充足睡眠，避免劳累过度。饮食调理：多进食性热的食物，如羊肉、鸡肉等肉类熟食，以及荔枝、龙眼、栗子、核桃等，日常可服用韭菜炒虾仁，韭菜炒核桃，冬季可服用当归生姜羊肉汤。少吃生冷食物，少吃冰激凌等寒凉类食物。可用艾灸保健。\n", "阳虚质")
	_, _ = stmt.Exec("饮食调理：可常食山药、粳米、小米、黄米、大麦、马铃薯、大枣、胡萝卜、香菇、豆腐、鸡肉、牛肉、青鱼、鲢鱼、龙眼肉、莲子等。气虚严重者可在医生的指导下服用人参、黄芪。起居上要做到劳逸结合，睡眠充足。可适当练习八段锦、太极拳等，春冬两季注意保暖，防寒邪易伤脾胃。\n", "阴虚质")
	_, _ = stmt.Exec("环境调摄：痰湿体质者不宜居住在潮湿的环境里；在阴雨季节，要注意防潮，可使用除湿器。饮食调理：少进食肥甘厚味的食物，多吃蔬菜、水果，尤其是多吃具有健脾利湿、化痰祛湿的食物，如白萝卜、洋葱、白扁豆等。可以使用玉米须、绞股蓝、党参泡水，多进食能行气的食物，如橙子、桔皮、荞麦、韭菜、茴香菜，陈皮、玫瑰花、茉莉花、山楂等。\n", "痰湿质")
	_, _ = stmt.Exec("湿热体质的人调养原则为燥湿清热，饮食清淡。在饮食上尽量做到不嗜烟酒，不吃油炸厚腻的食物，也尽量少吃一些大热大补的食物。运动上，适合做高强度、大运动量的锻炼，如中长跑、游泳、爬山、各种球类等运动。湿热明显或已进入中年的人，可选用清热利湿的药物进行调理。如常用菊花、苦丁茶沸水泡服，可起到清热舒爽的作用。起居养生应注意，居住环境宜干燥，通风，避免外湿入体，影响脾胃与心情。\n", "湿热质")
	_, _ = stmt.Exec("饮食调理：可常食山药、粳米、小米、黄米、大麦、马铃薯、大枣、胡萝卜、香菇、豆腐、鸡肉、牛肉、青鱼、鲢鱼、龙眼肉、莲子等。气虚严重者可在医生的指导下服用人参、黄芪。起居上要做到劳逸结合，睡眠充足。可适当练习八段锦、太极拳等，春冬两季注意保暖，防寒邪易伤脾胃。\n", "气虚质")
	_, _ = stmt.Exec("培养乐观的情绪，精神愉快则气血和畅，少生闷气，少动怒，有利于血瘀体质的改善。饮食调理：可常进食桃仁、油菜、黑大豆、山楂、玫瑰等，避免生冷之品；。也可食用山楂粥、花生粥。血瘀体质者可选用活血养血之品，在医生的指导下可使用丹参、川芎、当归、三七粉、枸杞、阿胶、红枣等。生活中多做有利于关节活动的运动，比如健美操、瑜伽等。\n", "血瘀质")
	_, _ = stmt.Exec("此体质多为遗传因素，饮食上注意荤素搭配，过敏体质者要避开辛辣、腥味等刺激性强的食物；生活中，过敏体质者要注意季节变化，尤其是春夏季，减少外出时间，防止花粉等异物过敏；积极体检，做到及时预防，及时诊治，调养身心健康。\n", "特禀质")
	_, _ = stmt.Exec("气郁体质需保持心情舒畅，避免思虑过度、心情抑郁。饮食上建议多食芽类、绿叶类、行气类食物，如春芽、韭菜、陈皮粥、葡萄干等，也可多进食柠檬、橙子、陈皮等柑橘类水果，保持心境平和。可在医生的指导下服用逍遥丸等。\n", "气郁质")
	_, _ = stmt.Exec("保持积极的状态，饮食均衡，保持良好的生活作息，适当锻炼。\n", "平和质")
}
